tools/fio_rw_2025-12-17_185754.log
rand_rw_test: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
fio-3.36
Starting 1 process

rand_rw_test: (groupid=0, jobs=1): err= 0: pid=1917969: Wed Dec 17 18:57:55 2025
  read: IOPS=92.2k, BW=360MiB/s (377MB/s)(512MiB/1422msec)
    slat (nsec): min=702, max=55670, avg=2282.93, stdev=1867.16
    clat (nsec): min=275, max=3509.7k, avg=133134.59, stdev=140497.51
     lat (nsec): min=1032, max=3511.3k, avg=135417.52, stdev=140813.02
    clat percentiles (nsec):
     |  1.00th=[    294],  5.00th=[    330], 10.00th=[   2672],
     | 20.00th=[   6816], 30.00th=[  13120], 40.00th=[  70144],
     | 50.00th=[ 107008], 60.00th=[ 142336], 70.00th=[ 193536],
     | 80.00th=[ 250880], 90.00th=[ 317440], 95.00th=[ 374784],
     | 99.00th=[ 497664], 99.50th=[ 544768], 99.90th=[ 716800],
     | 99.95th=[ 888832], 99.99th=[2998272]
   bw (  KiB/s): min=365576, max=371968, per=100.00%, avg=368772.00, stdev=4519.83, samples=2
   iops        : min=91394, max=92992, avg=92193.00, stdev=1129.96, samples=2
  write: IOPS=92.2k, BW=360MiB/s (378MB/s)(512MiB/1422msec); 0 zone resets
    slat (nsec): min=1440, max=60636, avg=3035.43, stdev=2105.88
    clat (usec): min=12, max=2996, avg=34.14, stdev=37.26
     lat (usec): min=16, max=2998, avg=37.18, stdev=37.33
    clat percentiles (usec):
     |  1.00th=[   20],  5.00th=[   23], 10.00th=[   24], 20.00th=[   27],
     | 30.00th=[   29], 40.00th=[   31], 50.00th=[   33], 60.00th=[   35],
     | 70.00th=[   37], 80.00th=[   40], 90.00th=[   44], 95.00th=[   49],
     | 99.00th=[   63], 99.50th=[   70], 99.90th=[   87], 99.95th=[  114],
     | 99.99th=[ 2737]
   bw (  KiB/s): min=365472, max=369736, per=99.68%, avg=367604.00, stdev=3015.10, samples=2
   iops        : min=91368, max=92434, avg=91901.00, stdev=753.78, samples=2
  lat (nsec)   : 500=3.57%, 750=0.06%, 1000=0.01%
  lat (usec)   : 2=0.48%, 4=2.76%, 10=6.04%, 20=5.81%, 50=48.94%
  lat (usec)   : 100=6.32%, 250=15.91%, 500=9.62%, 750=0.44%, 1000=0.02%
  lat (msec)   : 2=0.01%, 4=0.02%
  cpu          : usr=15.34%, sys=48.56%, ctx=85123, majf=0, minf=16
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=131040,131104,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=360MiB/s (377MB/s), 360MiB/s-360MiB/s (377MB/s-377MB/s), io=512MiB (537MB), run=1422-1422msec
  WRITE: bw=360MiB/s (378MB/s), 360MiB/s-360MiB/s (378MB/s-378MB/s), io=512MiB (537MB), run=1422-1422msec

Disk stats (read/write):
  nvme0n1: ios=78035/129163, sectors=624280/1038184, merge=0/0, ticks=16021/2652, in_queue=18674, util=62.15%