tools/fio_rw_2025-12-17_193033.log
rand_rw_test: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
fio-3.36
Starting 1 process

rand_rw_test: (groupid=0, jobs=1): err= 0: pid=1929391: Wed Dec 17 19:30:34 2025
  read: IOPS=90.9k, BW=355MiB/s (372MB/s)(512MiB/1442msec)
    slat (nsec): min=675, max=114502, avg=2550.32, stdev=2165.80
    clat (nsec): min=282, max=3584.1k, avg=132765.95, stdev=138252.84
     lat (nsec): min=985, max=3585.9k, avg=135316.27, stdev=138496.63
    clat percentiles (nsec):
     |  1.00th=[    314],  5.00th=[    394], 10.00th=[   3216],
     | 20.00th=[   8640], 30.00th=[  16512], 40.00th=[  72192],
     | 50.00th=[ 108032], 60.00th=[ 142336], 70.00th=[ 189440],
     | 80.00th=[ 248832], 90.00th=[ 313344], 95.00th=[ 370688],
     | 99.00th=[ 485376], 99.50th=[ 536576], 99.90th=[ 643072],
     | 99.95th=[ 774144], 99.99th=[3031040]
   bw (  KiB/s): min=360800, max=367392, per=100.00%, avg=364096.00, stdev=4661.25, samples=2
   iops        : min=90200, max=91848, avg=91024.00, stdev=1165.31, samples=2
  write: IOPS=90.9k, BW=355MiB/s (372MB/s)(512MiB/1442msec); 0 zone resets
    slat (nsec): min=1369, max=180260, avg=3380.50, stdev=2489.91
    clat (usec): min=12, max=2835, avg=36.34, stdev=30.63
     lat (usec): min=17, max=2837, avg=39.72, stdev=30.84
    clat percentiles (usec):
     |  1.00th=[   20],  5.00th=[   23], 10.00th=[   25], 20.00th=[   28],
     | 30.00th=[   30], 40.00th=[   32], 50.00th=[   35], 60.00th=[   37],
     | 70.00th=[   39], 80.00th=[   43], 90.00th=[   49], 95.00th=[   56],
     | 99.00th=[   84], 99.50th=[   99], 99.90th=[  127], 99.95th=[  169],
     | 99.99th=[ 2212]
   bw (  KiB/s): min=360912, max=365216, per=99.83%, avg=363064.00, stdev=3043.39, samples=2
   iops        : min=90228, max=91304, avg=90766.00, stdev=760.85, samples=2
  lat (nsec)   : 500=2.99%, 750=0.09%, 1000=0.01%
  lat (usec)   : 2=0.13%, 4=2.53%, 10=5.27%, 20=6.15%, 50=48.22%
  lat (usec)   : 100=8.26%, 250=16.50%, 500=9.44%, 750=0.38%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.02%
  cpu          : usr=14.43%, sys=52.81%, ctx=87046, majf=0, minf=12
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=131040,131104,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=355MiB/s (372MB/s), 355MiB/s-355MiB/s (372MB/s-372MB/s), io=512MiB (537MB), run=1442-1442msec
  WRITE: bw=355MiB/s (372MB/s), 355MiB/s-355MiB/s (372MB/s-372MB/s), io=512MiB (537MB), run=1442-1442msec

Disk stats (read/write):
  nvme0n1: ios=76887/127291, sectors=615096/1018328, merge=0/0, ticks=15397/2537, in_queue=17934, util=64.02%