tools/fio_rw_2025-12-17_194537.log
rand_rw_test: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
fio-3.36
Starting 1 process

rand_rw_test: (groupid=0, jobs=1): err= 0: pid=1934820: Wed Dec 17 19:45:39 2025
  read: IOPS=91.6k, BW=358MiB/s (375MB/s)(512MiB/1431msec)
    slat (nsec): min=709, max=66674, avg=2434.65, stdev=2087.68
    clat (nsec): min=285, max=4039.7k, avg=132131.84, stdev=137265.17
     lat (nsec): min=1058, max=4052.1k, avg=134566.50, stdev=137574.82
    clat percentiles (nsec):
     |  1.00th=[    306],  5.00th=[    358], 10.00th=[   2896],
     | 20.00th=[   7712], 30.00th=[  15040], 40.00th=[  73216],
     | 50.00th=[ 107008], 60.00th=[ 140288], 70.00th=[ 189440],
     | 80.00th=[ 248832], 90.00th=[ 317440], 95.00th=[ 370688],
     | 99.00th=[ 481280], 99.50th=[ 528384], 99.90th=[ 651264],
     | 99.95th=[ 741376], 99.99th=[3063808]
   bw (  KiB/s): min=361728, max=373400, per=100.00%, avg=367564.00, stdev=8253.35, samples=2
   iops        : min=90432, max=93350, avg=91891.00, stdev=2063.34, samples=2
  write: IOPS=91.6k, BW=358MiB/s (375MB/s)(512MiB/1431msec); 0 zone resets
    slat (nsec): min=1391, max=36417, avg=3211.79, stdev=2354.01
    clat (usec): min=9, max=3621, avg=35.95, stdev=38.89
     lat (usec): min=17, max=3630, avg=39.16, stdev=39.08
    clat percentiles (usec):
     |  1.00th=[   20],  5.00th=[   23], 10.00th=[   25], 20.00th=[   28],
     | 30.00th=[   30], 40.00th=[   32], 50.00th=[   34], 60.00th=[   36],
     | 70.00th=[   38], 80.00th=[   42], 90.00th=[   47], 95.00th=[   55],
     | 99.00th=[   93], 99.50th=[  106], 99.90th=[  128], 99.95th=[  139],
     | 99.99th=[ 2868]
   bw (  KiB/s): min=359808, max=373168, per=100.00%, avg=366488.00, stdev=9446.95, samples=2
   iops        : min=89952, max=93292, avg=91622.00, stdev=2361.74, samples=2
  lat (nsec)   : 500=3.29%, 750=0.06%, 1000=0.01%
  lat (usec)   : 2=0.28%, 4=2.56%, 10=5.73%, 20=5.79%, 50=48.13%
  lat (usec)   : 100=7.80%, 250=16.51%, 500=9.46%, 750=0.37%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.02%, 10=0.01%
  cpu          : usr=15.45%, sys=50.42%, ctx=85441, majf=0, minf=17
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=131040,131104,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=358MiB/s (375MB/s), 358MiB/s-358MiB/s (375MB/s-375MB/s), io=512MiB (537MB), run=1431-1431msec
  WRITE: bw=358MiB/s (375MB/s), 358MiB/s-358MiB/s (375MB/s-375MB/s), io=512MiB (537MB), run=1431-1431msec

Disk stats (read/write):
  nvme0n1: ios=77480/128252, sectors=619840/1026016, merge=0/0, ticks=15520/2581, in_queue=18100, util=63.42%